{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 96, 96, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 96, 96, 3], "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d/kernel", "shape": [2, 2, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15623120630488677, "scale": 0.001211094622518502, "original_dtype": "float32"}}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.012547782450622203, "scale": 0.00012803859643492044, "original_dtype": "float32"}}, {"name": "conv2d_1/kernel", "shape": [2, 2, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12534616250617833, "scale": 0.0010108561492433736, "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.009344543487417931, "scale": 8.985137968671088e-05, "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [2, 2, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1033556853147114, "scale": 0.0008402901245098488, "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.01177118495106697, "scale": 0.0001368742436170578, "original_dtype": "float32"}}, {"name": "conv2d_3/kernel", "shape": [2, 2, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09651277637949177, "scale": 0.0007910883309794407, "original_dtype": "float32"}}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.011406688238768016, "scale": 9.918859338059145e-05, "original_dtype": "float32"}}, {"name": "conv2d_4/kernel", "shape": [2, 2, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08052702709740284, "scale": 0.0006494115088500229, "original_dtype": "float32"}}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0124134409296162, "scale": 0.0001128494629965109, "original_dtype": "float32"}}, {"name": "conv2d_5/kernel", "shape": [2, 2, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07320855312487659, "scale": 0.000581020262895846, "original_dtype": "float32"}}, {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010105227565794598, "scale": 8.351427740326114e-05, "original_dtype": "float32"}}, {"name": "conv2d_6/kernel", "shape": [2, 2, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06855125067865148, "scale": 0.0005573272412898494, "original_dtype": "float32"}}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.011756387418683838, "scale": 9.256997967467588e-05, "original_dtype": "float32"}}, {"name": "conv2d_7/kernel", "shape": [2, 2, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07273343184999391, "scale": 0.0005727041877952277, "original_dtype": "float32"}}, {"name": "conv2d_7/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010031204992065243, "scale": 8.647590510401072e-05, "original_dtype": "float32"}}, {"name": "conv2d_8/kernel", "shape": [2, 2, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.061942465165082145, "scale": 0.00048392550910220425, "original_dtype": "float32"}}, {"name": "conv2d_8/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.012083253001465517, "scale": 0.00010069377501221264, "original_dtype": "float32"}}, {"name": "conv2d_9/kernel", "shape": [2, 2, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.057386993631428365, "scale": 0.000441438412549449, "original_dtype": "float32"}}, {"name": "conv2d_9/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010533210722839132, "scale": 9.752972891517714e-05, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [2048, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.057057189912188284, "scale": 0.0004835355077304092, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.013092472272760728, "scale": 0.0001091039356063394, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [512, 2], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11212554106525346, "scale": 0.0008625041620404113, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [2], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.01331308916503308, "scale": 0.00010400850910182093, "original_dtype": "float32"}}]}]}